/*

 @name    : 锅巴汉化 - Web汉化插件
 @author  : 麦子、JAR、小蓝、好阳光的小锅巴
 @version : V0.6.1 - 2019-07-09
 @website : http://www.g8hh.com

*/

//1.汉化杂项
var cnItems = {
    _OTHER_: [],

    //未分类：
    '✓ On': '✓ 开',
    '✗ Off': '✗ 关',
    'Achievements': '成就',
    'Additive': '添加剂',
    'Arcades': '街机',
    'Auto': '自动',
    'Cloud Saving': '云存储',
    'Cloud': '云端',
    'Confirm': '确认',
    'Cost': '成本',
    'Cost: $': '成本: $',
    'Currently Each': '当前每个',
    'Exchange': '转换',
    'Favors': '偏好',
    'Forever': '永远',
    'Forever AutoBuy': '永远自动购买',
    'Tickets': '门票',
    'total)': '总计)',
    'total': '总计',
    'tap!': '点击!',
    'Max': '最大',
    'Lease': '租赁',
    'Mana': '哪里',
    'Mixed': '混合',
    'More Coming Soon!': '更多内容及将推出！',
    'Offline Progress': '离线进度',
    'On': '开',
    'Net Income: $': '净利润:$',
    'No Cloud Save Detected': '未检测到云存档',
    'Reset': '重置',
    'Reset To Get': '重置以获得',
    'Retain All': '保留所有',
    'Retain': '保留',
    'Score': '分数',
    'Savings: $': '节省:$',
    'Share Alerts': '股份提醒',
    'Share Multi': '股份加成',
    'Share/Arcade': '股份/街机',
    'Shop': '商店',
    'Basic Upgrade': '几本升级',
    'Better': '更好',
    'Cancel': '取消',
    'Cash Out': '提现',
    'Donations': '捐款',
    'Earn': '获取',
    'First Upgrades': '首次升级',
    'Info': '信息',
    'Keep': '保留',
    'More Shares': '更多股份',
    'Machine Upgrades': '机器升级',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',
    '': '',

    //原样
    '': '',
    '': '',

}


//需处理的前缀
var cnPrefix = {
    "(-": "(-",
    "(+": "(+",
    "(": "(",
    "-": "-",
    "+": "+",
    " ": " ",
    ": ": "： ",
    "\n": "",
    "                   ": "",
    "                  ": "",
    "                 ": "",
    "                ": "",
    "               ": "",
    "              ": "",
    "             ": "",
    "            ": "",
    "           ": "",
    "          ": "",
    "         ": "",
    "        ": "",
    "       ": "",
    "      ": "",
    "     ": "",
    "    ": "",
    "   ": "",
    "  ": "",
    " ": "",
    "Auto ": "自动 ",
    "Current ": "当前 ",
    "Ticket ": "门票 ",
    "Total ": "总计 ",
}

//需处理的后缀
var cnPostfix = {
    ":": "：",
    "：": "：",
    ": ": "： ",
    "： ": "： ",
    " ": "",
    "/s)": "/s)",
    "/s": "/s",
    ")": ")",
    "%": "%",
    "                   ": "",
    "                  ": "",
    "                 ": "",
    "                ": "",
    "               ": "",
    "              ": "",
    "             ": "",
    "            ": "",
    "           ": "",
    "          ": "",
    "         ": "",
    "        ": "",
    "       ": "",
    "      ": "",
    "     ": "",
    "    ": "",
    "   ": "",
    "  ": "",
    " ": "",
    "\n": "",
}

//需排除的，正则匹配
var cnExcludeWhole = [
    /^x?\d+(\.\d+)?[A-Za-z%]{0,2}(\s.C)?\s*$/, //12.34K,23.4 °C
    /^x?\d+(\.\d+)?(e[+\-]?\d+)?\s*$/, //12.34e+4
    /^\s*$/, //纯空格
    /^\d+(\.\d+)?[A-Za-z]{0,2}.?\(?([+\-]?(\d+(\.\d+)?[A-Za-z]{0,2})?)?$/, //12.34M (+34.34K
    /^(\d+(\.\d+)?[A-Za-z]{0,2}\/s)?.?\(?([+\-]?\d+(\.\d+)?[A-Za-z]{0,2})?\/s\stot$/, //2.74M/s (112.4K/s tot
    /^\d+(\.\d+)?(e[+\-]?\d+)?.?\(?([+\-]?(\d+(\.\d+)?(e[+\-]?\d+)?)?)?$/, //2.177e+6 (+4.01+4
    /^(\d+(\.\d+)?(e[+\-]?\d+)?\/s)?.?\(?([+\-]?(\d+(\.\d+)?(e[+\-]?\d+)?)?)?\/s\stot$/, //2.177e+6/s (+4.01+4/s tot
];
var cnExcludePostfix = [
    /:?\s*x?\d+(\.\d+)?(e[+\-]?\d+)?\s*$/, //12.34e+4
    /:?\s*x?\d+(\.\d+)?[A-Za-z]{0,2}$/, //: 12.34K, x1.5
]

//正则替换，带数字的固定格式句子
//纯数字：(\d+)
//逗号：([\d\.,]+)
//小数点：([\d\.]+)
//原样输出的字段：(.+)
var cnRegReplace = new Map([
    [/^requires ([\d\.]+) more research points$/, '需要$1个研究点'],
    [/^(\d+) Royal points$/, '$1 皇家点数'],
    [/^Cost: (\d+) RP$/, '成本：$1 皇家点数'],
    [/^Usages: (\d+)\/$/, '用途：$1\/'],
    [/^workers: (\d+)\/$/, '工人：$1\/'],

]);